{
  "title": "Other Branches",
  "slug": "branches",
  "sections": [
    {
      "heading": "Our Branches",
      "content": "Schools managed by the Modern School Society represent a unified vision of holistic education, founded upon the ideals of Lala Raghubir Singh. Each branch maintains a shared heritage while evolving to meet the educational needs of contemporary society."
    },
    {
      "heading": "The Modern School, Barakhamba Road",
      "content": "The sprawling 25-acre campus in the heart of New Delhi houses one of the premier and foremost public schools of the country. Established in 1920, it continues to embody the founder’s ideals of intellectual freedom, cultural rootedness, and moral strength.\nWebsite: www.modernschool.net"
    },
    {
      "heading": "Raghubir Singh Junior Modern School, Humayun Road",
      "content": "Raghubir Singh Junior Modern School is the primary wing of The Modern School, Barakhamba Road. It houses classes from Nursery to P5 and provides a strong foundation of values and knowledge that prepares children for their journey ahead.\nWebsite: www.rsjms.com"
    },
    {
      "heading": "The Modern School, Vasant Vihar",
      "content": "A sister institution of Modern School, Barakhamba Road, this branch caters to both primary and secondary education. It is recognised for its strong academic standards, student leadership programmes, and commitment to innovation in teaching.\nWebsite: www.modernschoolvv.com"
    },
    {
      "heading": "The Modern School, ECNCR Delhi",
      "content": "Opened in 2014 on an 11-acre campus in Kundli, the Modern School ECNCR represents the Society’s latest expansion into the National Capital Region. It also maintains an early years facility at Deepali Chowk.\nWebsite: www.modernschoolec.com"
    },
    {
      "heading": "The Modern School, Faridabad",
      "content": "Located in Sector 85, BPTP Parklands, Faridabad, this campus offers both primary and secondary education. Well-connected to Delhi and Greater Noida, it continues the Modern School tradition of excellence in academics and co-curricular engagement.\nWebsite: www.modernschoolfd.com"
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
