{
  "title": "Community Services",
  "slug": "community-services",
  "sections": [
    {
      "heading": "Overview",
      "content": "Community service is an integral component of life at Raghubir Singh Junior Modern School. The school encourages students to look beyond themselves and engage actively with their surroundings. From environmental initiatives to social outreach, RSJMS instills empathy, responsibility, and civic awareness from an early age."
    },
    {
      "heading": "Environmental Awareness",
      "content": "Students regularly participate in plantation drives, clean-up campaigns, and recycling initiatives. The school’s Green Drive promotes eco-friendly habits such as waste segregation, reduced plastic use, and energy conservation. Special assemblies and classroom activities reinforce the message that caring for the planet begins with individual action."
    },
    {
      "heading": "Support for the Underprivileged",
      "content": "Through partnerships with NGOs and charitable organisations, RSJMS students contribute to clothing, stationery, and food donation drives. Events such as the Winter Carnival and Goonj’s ‘Power of 5’ campaign raise awareness and resources for underprivileged children, teaching students the value of compassion in action."
    },
    {
      "heading": "Visits and Outreach",
      "content": "Community visits to old-age homes, orphanages, and special schools are a regular feature of the RSJMS calendar. These experiences help children develop sensitivity and gratitude, as they learn that giving time and attention is often more meaningful than material contribution."
    },
    {
      "heading": "Civic and Health Initiatives",
      "content": "The school promotes health and hygiene awareness through workshops and classroom discussions. Students take part in road safety campaigns, cleanliness drives, and water conservation projects. The focus is on understanding civic responsibility as an essential part of good citizenship."
    },
    {
      "heading": "Spirit of Service",
      "content": "At RSJMS, community service is not an extracurricular activity — it is a mindset. It encourages children to become aware, active, and compassionate citizens, capable of contributing to a more equitable and sustainable world."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
