{
  "title": "Infrastructure and Facilities",
  "slug": "facilities",
  "sections": [
    {
      "heading": "Overview",
      "content": "The infrastructure of Raghubir Singh Junior Modern School is designed to foster creativity, curiosity, and comfort. Each facility reflects the school’s commitment to providing an environment conducive to holistic learning, innovation, and well-being."
    },
    {
      "heading": "Classrooms Equipped with Smart Boards",
      "content": "All classes, from Nursery to P5, have been converted into Smart Board Digi Classes. Teachers supplement the curriculum using a digital resource bank that is subject- and class-specific. Each classroom is equipped with air purifiers, ensuring a healthy learning atmosphere free from pollution and distractions."
    },
    {
      "heading": "Auditorium – Doris David Auditorium",
      "content": "The Doris David Auditorium is a spacious, air-conditioned hall equipped with a large stage, digital light and sound systems, and modern seating. It serves as the venue for morning assemblies, school events, inter-school competitions, and cultural performances, providing students a platform to express themselves with confidence."
    },
    {
      "heading": "Library",
      "content": "The school’s Library Learning Programme introduces children to the world of literature through storytelling, author visits, book reviews, and creative writing. Activities include story narration with visual aids, listening to audio stories, creative post-listening sessions, and reading circles designed to cultivate a lifelong love for books and learning."
    },
    {
      "heading": "Computer Labs",
      "content": "RSJMS maintains two state-of-the-art computer laboratories, equipped with updated systems and multimedia facilities. Students from P1 to P5 learn computer science through structured lessons that combine theory with creative application. The curriculum emphasises problem-solving, responsible use of technology, and innovation."
    },
    {
      "heading": "Music Room",
      "content": "Learning the basics of music is an integral part of school life. Trained music educators help students develop rhythm, melody, and performance skills. Children are encouraged to participate in intra- and inter-school events, gaining exposure and confidence as performers."
    },
    {
      "heading": "Dance Rooms",
      "content": "The school has two dedicated dance rooms where students from P1 to P5 learn various dance forms. Regular classes foster teamwork, coordination, discipline, and creative expression. Introducing dance at an early age cultivates both confidence and grace."
    },
    {
      "heading": "Chess Room",
      "content": "Chess is introduced at an early age to help students sharpen focus, concentration, and logical reasoning. The chess room provides a space for strategy, patience, and critical thinking. Students regularly participate in inter-house and inter-school chess tournaments, earning laurels for the school."
    },
    {
      "heading": "Science Park",
      "content": "An interactive outdoor learning space, the Science Park features exhibits that simplify complex scientific principles. Displays include models of levers, solar eclipses, sundials, periscopes, rope-and-pulley systems, and Newton’s colour disc. It encourages tactile learning through exploration and play."
    },
    {
      "heading": "Outdoor Play Area – A Hub of Joy",
      "content": "The vibrant outdoor play area for pre-primary students is filled with safe, colourful equipment designed to develop motor skills, creativity, and imagination. It provides a stimulating and joyful environment where children explore, learn, and build friendships amidst nature."
    },
    {
      "heading": "Learning Centre",
      "content": "The Learning Centre provides behavioural guidance, emotional support, and intervention sessions for students. Weekly classroom discussions and special assemblies help address behavioural challenges with empathy and understanding, ensuring every child feels heard and supported."
    },
    {
      "heading": "Conference Room",
      "content": "The school’s conference room serves as a hub for meetings, workshops, and collaborative sessions. Equipped with digital conferencing tools, it hosts administrative discussions, parent-teacher interactions, and staff training sessions aimed at continuous professional development."
    },
    {
      "heading": "Infirmary",
      "content": "A well-equipped infirmary staffed by trained medical personnel ensures that immediate medical attention is available whenever needed. The infirmary is designed to promote comfort and calm, with special attention to hygiene and care during school hours."
    },
    {
      "heading": "Art Room and Clay Room",
      "content": "The Art and Clay Rooms offer children the chance to express their imagination through visual mediums. From sketching and colouring to clay modelling, students learn to appreciate aesthetics, form, and texture while developing patience and dexterity. These spaces are among the most vibrant corners of the school, reflecting the joyful creativity of young minds."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
