{
  "title": "House System",
  "slug": "house-system",
  "sections": [
    {
      "heading": "Overview",
      "content": "The House System at Raghubir Singh Junior Modern School lies at the heart of school life. It promotes teamwork, healthy competition, leadership, and a sense of belonging among students. Every child from Class 1 onward is placed into one of the four houses, and through participation in inter-house activities, they develop camaraderie, discipline, and school spirit."
    },
    {
      "heading": "The Four Houses",
      "content": "1. **Saraswati House (Blue)** – Symbolises wisdom, learning, and creativity. The house encourages intellectual curiosity and excellence in academics and the arts.\n\n2. **Ashoka House (Green)** – Represents peace, service, and environmental consciousness. Members of this house uphold harmony and are active participants in social service and ecological projects.\n\n3. **Raman House (Yellow)** – Inspired by Sir C.V. Raman, it stands for inquiry, innovation, and scientific thinking. The house motivates students to think logically, question deeply, and experiment fearlessly.\n\n4. **Tagore House (Red)** – Embodies creativity, empathy, and cultural pride. It celebrates artistic expression and the spirit of unity through literature, music, and performance."
    },
    {
      "heading": "Inter-House Activities",
      "content": "A variety of inter-house events are held throughout the year, ranging from debates, quizzes, elocution contests, and sports tournaments to art and music competitions. Each event contributes points toward the coveted **House Trophy**, awarded annually to the house that demonstrates excellence in academics, discipline, and co-curricular participation."
    },
    {
      "heading": "House Captains and Prefectorial Board",
      "content": "The House System encourages leadership from an early age. Students who demonstrate initiative, reliability, and empathy are appointed as **House Captains** and **Vice-Captains**. The Prefectorial Board, headed by the School Captain, is responsible for maintaining discipline and promoting a positive school culture through peer guidance and teamwork."
    },
    {
      "heading": "Spirit of RSJMS",
      "content": "The House System at RSJMS is not limited to competition—it is a community. It fosters belonging, friendship, and pride in shared achievement, reflecting the school’s ethos of holistic development and mutual respect."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
