{
  "title": "Parent Collaboration",
  "slug": "parent-collaboration",
  "sections": [
    {
      "heading": "Overview",
      "content": "Raghubir Singh Junior Modern School believes that education is a shared journey between the school and the home. Active parental involvement enhances a child’s learning experience and helps create a stronger, more empathetic community. The school’s Parent Collaboration Programme encourages dialogue, transparency, and participation across academic and co-curricular spheres."
    },
    {
      "heading": "Orientation Programme",
      "content": "Each academic year begins with a structured Orientation Programme that introduces parents to the curriculum, teaching philosophy, and activity calendar. Teachers outline expectations, learning goals, and evaluation methods. This early engagement helps parents support their children effectively throughout the year."
    },
    {
      "heading": "Workshops and Seminars",
      "content": "The school organizes interactive workshops for parents on child psychology, health and nutrition, study habits, responsible screen use, and emotional well-being. Experts and educators collaborate to address contemporary challenges and to strengthen the school-home connection through informed, balanced communication."
    },
    {
      "heading": "Classroom Involvement",
      "content": "Parents are occasionally invited to observe or participate in classroom projects, story sessions, and cultural programmes. This interaction gives them insight into teaching methodologies and student collaboration, while children enjoy a sense of pride when their parents take part in their school life."
    },
    {
      "heading": "Parent–Teacher Association (PTA)",
      "content": "The PTA at RSJMS plays a crucial role in fostering communication and community spirit. Regular meetings allow parents and teachers to exchange ideas, provide feedback, and collectively work toward the improvement of school policies, facilities, and student welfare initiatives."
    },
    {
      "heading": "Communication Channels",
      "content": "Parent collaboration is supported by regular newsletters, the school website, and the RSJMS communication app. These ensure that parents are informed about events, schedules, and updates in real time. The emphasis remains on partnership — sharing responsibility for the growth and happiness of every child."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
