{
  "title": "Publications",
  "slug": "publications",
  "sections": [
    {
      "heading": "Overview",
      "content": "Raghubir Singh Junior Modern School maintains a vibrant tradition of student publications. These serve as creative outlets for children, reflecting their imagination, thoughts, and achievements throughout the academic year. Each publication records the rhythm of school life — from academic milestones to co-curricular vibrancy."
    },
    {
      "heading": "Sandesh – The School Magazine",
      "content": "The school magazine *Sandesh* is published biannually — the first issue appears in October–November and the second at the end of the academic session. It captures the voices of students through articles, poems, reports, artwork, and photographs. Each edition of *Sandesh* serves as a living chronicle of RSJMS life, preserving memories, events, and creative expressions."
    },
    {
      "heading": "The RSJMS Newsletter",
      "content": "The *RSJMS Newsletter* is a periodic bulletin highlighting recent events, achievements, and upcoming programmes. It provides parents and the school community with updates on classroom innovations, workshops, performances, and outreach initiatives, reinforcing the connection between home and school."
    },
    {
      "heading": "Annual Reports",
      "content": "The Annual Report provides a comprehensive overview of the school’s achievements across academics, sports, performing arts, and community initiatives. It reflects the collaborative spirit of teachers, students, and parents, and documents the milestones of each academic year."
    },
    {
      "heading": "Purpose and Philosophy",
      "content": "The publication programme is an extension of the school’s educational vision — empowering students to express themselves confidently, to write with purpose, and to celebrate both individual and collective accomplishments. It nurtures communication, reflection, and creative self-expression as vital aspects of learning."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
