{
  "title": "Terms and Conditions",
  "slug": "terms-conditions",
  "sections": [
    {
      "heading": "Website Usage Policy",
      "content": "Welcome to the official website of Raghubir Singh Junior Modern School (RSJMS). By accessing or using this website, you agree to comply with and be bound by the following terms and conditions of use. These terms govern your relationship with RSJMS in relation to this website."
    },
    {
      "heading": "General Information",
      "content": "The content provided on this website is for general information and educational purposes only. While every effort is made to ensure accuracy, RSJMS does not guarantee the completeness, reliability, or timeliness of information displayed. The school reserves the right to modify content, policies, or links without prior notice."
    },
    {
      "heading": "Copyright Notice",
      "content": "All text, images, logos, and design elements on this website are the intellectual property of Raghubir Singh Junior Modern School. Reproduction or redistribution of any material, in whole or in part, without explicit written consent is strictly prohibited."
    },
    {
      "heading": "External Links",
      "content": "This website may include links to external websites for reference or convenience. RSJMS does not endorse or take responsibility for the content, privacy policies, or practices of these external sites."
    },
    {
      "heading": "Privacy Policy",
      "content": "RSJMS respects the privacy of all visitors. Any personal information collected through forms or communication will be used solely for official school purposes and will not be shared or disclosed without consent, unless required by law."
    },
    {
      "heading": "Limitation of Liability",
      "content": "Under no circumstances shall RSJMS or its affiliates be liable for any direct or indirect damages arising from the use or inability to use this website or its materials. Users are advised to verify information independently before acting upon it."
    },
    {
      "heading": "Contact",
      "content": "For queries related to these terms or website use, please contact the school administration via the official contact page or at admin@rsjms.com."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
