{
  "title": "School Trips and Excursions",
  "slug": "trips",
  "sections": [
    {
      "heading": "Overview",
      "content": "Excursions and educational trips at Raghubir Singh Junior Modern School form an essential part of experiential learning. Each trip is designed to expose children to new environments, cultures, and ideas, extending learning beyond the classroom walls. These journeys foster independence, curiosity, teamwork, and responsibility."
    },
    {
      "heading": "Local Excursions",
      "content": "Short-distance trips are planned throughout the academic year for various age groups. Visits to museums, historical monuments, farms, theatres, and science centres enrich classroom lessons with direct observation and hands-on experience. These outings also cultivate social awareness and civic sense among students."
    },
    {
      "heading": "Outstation Trips",
      "content": "Every year, students of Classes P3 to P5 undertake supervised outstation trips to culturally and ecologically significant destinations across India. From exploring Jaipur’s forts to visiting Dehradun’s scientific institutions, such experiences blend recreation with learning, helping children understand the diversity and richness of the country."
    },
    {
      "heading": "International Educational Exchanges",
      "content": "RSJMS organises educational exchange programmes in collaboration with partner schools abroad, such as the Nanyang Primary School in Singapore and Colegio Teresa Berganza in Madrid. These programmes foster intercultural understanding, global citizenship, and a spirit of mutual respect through shared projects, art, and language interactions."
    },
    {
      "heading": "Learning Outcomes",
      "content": "Trips and excursions strengthen peer relationships, enhance emotional maturity, and help children appreciate community living. They return with stories, insights, and friendships that deepen their understanding of life beyond textbooks, fulfilling the school’s vision of holistic education."
    }
  ],
  "source": "RSJMS Official Website",
  "lastUpdated": "2025-10-07"
}
